Bartchez/quad-stm32/Program/_Application/main.c
 								   
/* Includes ------------------------------------------------------------------*/ 
#include "stm32f10x.h" 
 
// Configurations 
#include "qdt_config.h" 
//#include "core_cm3.h" 

// Common files
#include "rfm12_controller.h" 
#include "rfm12.h" 
 
// Own libraries 
#ifdef PILOT
#include "sd.h"
#include "lcd.h"
#endif

#ifdef QUAD
#include "gps.h" 
#include "18B20.h" 
#include "MPL115A2.h" 
#include "battery.h"
#endif

 
/* Private typedef -----------------------------------------------------------*/ 
/* Private define ------------------------------------------------------------*/ 
/* Private macro -------------------------------------------------------------*/ 
/* Private variables ---------------------------------------------------------*/ 
static vu32 TimingDelay = 0;

/* Private function prototypes -----------------------------------------------*/ 
void RCC_Configuration(void); 
void TIM_Configuration(void); 
void SPI_Configuration(void); 
void GPIO_Configuration(void); 
void NVIC_Configuration(void); 
void EXTI_Configuration(void); 
void USART_Configuration(void); 
void SysTick_Configuration(void); 
void I2C_Configuration(void); 
void ADC_Configuration(void); 
void DMA_Configuration(void); 
 
/* Private functions ---------------------------------------------------------*/ 
void Delay_ms(u32 nCount);
void TimingDelay_Decrement(void);
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
int main(void)  
{ 

	volatile unsigned long int i;
//	unsigned long int napiecie, temperatura;
//	unsigned char Tekst[7] = {"0\0"};

	uint8_t ret = 0; 
	char test[120]; 
	unsigned char wartoscADC1VTekst[7] = "text\0";
 
	/* NVIC Configuration */ 
	NVIC_Configuration(); 
 
	/* System Clocks Configuration */ 
	RCC_Configuration(); 
 
	/* GPIO Configuration */ 
	GPIO_Configuration(); 
 
	/* USART Configuration */ 
	USART_Configuration(); 
 
	/* SPI Configuration */ 
	SPI_Configuration(); 
 
	/* EXTI Configuration */ 
	EXTI_Configuration(); 
 
	/* TIM Configuration */ 
	TIM_Configuration(); 
 
	/* I2C Configuration */ 
	I2C_Configuration(); 

	/* DMA Configuration */
	DMA_Configuration(); 

	/* ADC Configuration */ 
	ADC_Configuration();

	/* SysTick Configuration */ 
	SysTick_Configuration(); 
 
	/* Init rfm12 module */ 
	rf12_init();   

#ifdef PILOT

	/* Init SD card */
	sd_init();

	/* Init LCD */
    S65_init();

	/* RFM12 - rx start */
	rf12_rxstart(); 

	// draw init screen			  
	draw_screen_0();

#else
	/* Init GPS sensor */ 
	gps_init(); 
 
	/* Init send/recive rfm12 controller */ 
	rf12_controller_init(); 

	ADC_SoftwareStartConvCmd(ADC1, ENABLE);
#endif
	
	while (1)  					   
	{		  
		// blink LED 
		GPIO_ResetBits(LEDS_PORT, LED_BIT_1); //LED8 ON 
    	GPIO_SetBits(LEDS_PORT, LED_BIT_2);   //LED9 OFF 
		Delay_ms(100); 
		GPIO_SetBits(LEDS_PORT, LED_BIT_1);   //LED9 ON 
    	GPIO_ResetBits(LEDS_PORT, LED_BIT_2); //LED8 OFF 
		Delay_ms(100); 

#ifdef PILOT

		// check button change
		detect_button();
 
		if( !(rf12_rx || rf12_tx || rf12_new) )  {
			rf12_rxstart(); 
		}
 
		if( rf12_new )	{ 
 
			ret = rf12_rxfinish(test);	// sprawdY czy odebrano kompletn1 ramke 
 
			if(ret > 0 && ret < 254) {	// brak bledów CRC - odebrana ramka 
				
				// save data to file on SD cart
				sd_write_line("quad.txt", test, ret, 1);

				// pars reviced data
				parse_rfm12(test, ret);

				// poprawnie odebrane dane
				GPIO_WriteBit(LEDS_PORT, LED_BIT_5,
					(BitAction)(1 - GPIO_ReadOutputDataBit(LEDS_PORT, LED_BIT_5)));
			} 
			else 
				 
			if(!ret) { // wyst1pi3 b31d CRC lub d3ugooci ramki 
				// blink - CRC error
				GPIO_WriteBit(LEDS_PORT, LED_BIT_6,
					(BitAction)(1 - GPIO_ReadOutputDataBit(LEDS_PORT, LED_BIT_6)));
			} 
		} 
#endif 
	}; 
} 

//////////////////////////////////////////////////////////////////////////////////////////////////// 
void GPIO_Configuration(void)  
{ 
  
	GPIO_InitTypeDef  GPIO_InitStructure;  
 
	/* Configure all unused GPIO port pins in Analog Input mode (floating input 
     trigger OFF), this will reduce the power consumption and increase the device 
     immunity against EMI/EMC *************************************************/ 

 
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_All; 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN; 
	GPIO_Init(GPIOA, &GPIO_InitStructure); 
	GPIO_Init(GPIOB, &GPIO_InitStructure); 
	GPIO_Init(GPIOC, &GPIO_InitStructure);  

	// GPIO for COM

	// USART1 - TX 
    GPIO_InitStructure.GPIO_Pin = COM_BIT_TX;	          
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;  
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;  
    GPIO_Init(COM_PORT, &GPIO_InitStructure);		    
 
 
	// USART1 - RX 
	GPIO_InitStructure.GPIO_Pin = COM_BIT_RX;	         
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;   
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;  
    GPIO_Init(COM_PORT, &GPIO_InitStructure); 

	// GPIO for LEDs

	//LEDs 
	GPIO_InitStructure.GPIO_Pin = LED_BIT_1 | LED_BIT_2 | LED_BIT_3 | LED_BIT_4 | LED_BIT_5 | LED_BIT_6; 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;  
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; 
	GPIO_Init(LEDS_PORT, &GPIO_InitStructure);  

	// GPIO for rfm12
 
	// SPI - CS 
	GPIO_InitStructure.GPIO_Pin = RFM12_BIT_SS; 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP; 
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; 
	GPIO_Init(RFM12_PORT_SS, &GPIO_InitStructure); 
 
	// SPI - INT 
	GPIO_InitStructure.GPIO_Pin = RFM12_BIT_INT; 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING; 
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; 
	GPIO_Init(RFM12_PORT_INT, &GPIO_InitStructure); 
 
	// SPI - SCK, MOSI 
	GPIO_InitStructure.GPIO_Pin = RFM12_BIT_SCK | RFM12_BIT_MOSI | RFM12_BIT_MISO; 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP; 
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; 
	GPIO_Init(RFM12_PORT_SPI, &GPIO_InitStructure); 

#ifdef PILOT 
	// GPIO for LCD
 
	//PWM 
	GPIO_InitStructure.GPIO_Pin = PWM_BIT_1; 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;  
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; 
	GPIO_Init(PWM_PORT, &GPIO_InitStructure); 

	// GPIO for SD
 
