Bartchez/quad-stm32/Program/_Application/main.c
    // SD - CS 
    GPIO_InitStructure.GPIO_Pin = SD_BIT_SS;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(SD_PORT_SS, &GPIO_InitStructure);

    //SD - SCK, MISO, MOSI
    GPIO_InitStructure.GPIO_Pin = SD_BIT_SCK | SD_BIT_MISO | SD_BIT_MOSI;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(SD_PORT_SPI, &GPIO_InitStructure);

	//SD - DETECT
    GPIO_InitStructure.GPIO_Pin = SD_BIT_DETECT;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(SD_PORT_DETECT, &GPIO_InitStructure);


	// GPIO for LCD
 
    // SD - CS 
    GPIO_InitStructure.GPIO_Pin = LCD_BIT_SS;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(LCD_PORT_SS, &GPIO_InitStructure);

    //SD - SCK, MOSI
    GPIO_InitStructure.GPIO_Pin = LCD_BIT_SCK | LCD_BIT_MOSI;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(LCD_PORT_SPI, &GPIO_InitStructure);


	// RS & RESET
    GPIO_InitStructure.GPIO_Pin   = LCD_PIN_RESET | LCD_PIN_RS;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
    GPIO_Init(LCD_PORT_LS020, &GPIO_InitStructure);
#endif 

#ifdef QUAD 

	// GPIO for I2C

    GPIO_InitStructure.GPIO_Pin =  PRESSURE_BIT_1 | PRESSURE_BIT_2; 
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; 
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD; 
    GPIO_Init(PRESSURE_PORT, &GPIO_InitStructure); 
 
	// GPIO for GPS
 
	// USART2 - TX 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD; 
	GPIO_InitStructure.GPIO_Pin = GPS_BIT_TX; 
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; 
	GPIO_Init(GPS_PORT, &GPIO_InitStructure); 
 
	// USART2 - RX 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING; 
	GPIO_InitStructure.GPIO_Pin = GPS_BIT_RX; 
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; 
	GPIO_Init(GPS_PORT, &GPIO_InitStructure); 

	// GPIO for TEMPERATURE
 
	// TEMPERATURE 
	GPIO_InitStructure.GPIO_Pin = TEMPERATURE_BIT_1 | TEMPERATURE_BIT_2 | TEMPERATURE_BIT_3 | TEMPERATURE_BIT_4 |TEMPERATURE_BIT_5 | TEMPERATURE_BIT_6;	          
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;  
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; 
	GPIO_Init(TEMPERATURE_PORT, &GPIO_InitStructure);	 
  
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_5;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
	GPIO_Init(GPIOC, &GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_0 | GPIO_Pin_1;   
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;                                   //wejscie analogowe
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

#endif 
} 
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
void RCC_Configuration(void)  
{ 
 
	ErrorStatus HSEStartUpStatus;  //zmienna opisujaca rezultat uruchomienia HSE 
 
	/* RCC system reset(for debug purpose) */ 
	RCC_DeInit(); 
 
	/* Enable HSE */ 
	RCC_HSEConfig(RCC_HSE_ON); 
 
	/* Wait till HSE is ready */ 
	HSEStartUpStatus = RCC_WaitForHSEStartUp(); 
	 
	if (HSEStartUpStatus == SUCCESS) 
 	{ 
    	/* Enable Prefetch Buffer */ 
		FLASH_PrefetchBufferCmd(FLASH_PrefetchBuffer_Enable); 
 
		/* Flash 2 wait state */ 
		FLASH_SetLatency(FLASH_Latency_2); 
 
    	/* HCLK = SYSCLK */ 
		RCC_HCLKConfig(RCC_SYSCLK_Div1); 
 
    	/* PCLK2 = HCLK */ 
		RCC_PCLK2Config(RCC_HCLK_Div1); 
 
    	/* PCLK1 = HCLK/2 */ 
		RCC_PCLK1Config(RCC_HCLK_Div2); 
 
//    	/* PLLCLK = 8MHz * 9 = 72 MHz */ 
//		RCC_PLLConfig(RCC_PLLSource_HSE_Div1, RCC_PLLMul_9); 

		/* PLLCLK = HSE*7 czyli 8MHz * 7 = 56 MHz */  
  		RCC_PLLConfig(RCC_PLLSource_HSE_Div1, RCC_PLLMul_7);
 
    	/* Enable PLL */ 
		RCC_PLLCmd(ENABLE); 
 
    	/* Wait till PLL is ready */ 
		while (RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET) {} 
 
    	/* Select PLL as system clock source */ 
		RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK); 
 
    	/* Wait till PLL is used as system clock source */ 
		while (RCC_GetSYSCLKSource() != 0x08) {} 
	} 
 
	/* SPI1 clock enable */ 
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SPI1, ENABLE); 
 
#ifdef QUAD 
	/* GPIO A/B/C/D clock enable */ 
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC, ENABLE); 
#else
	/* GPIO A/B/C/D/E/G clock enable */ 
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC | RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOE | RCC_APB2Periph_GPIOG, ENABLE); 
#endif
  
	/* AFIO clock enable */ 
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE); 
 
	/* USART1 clock enable */ 
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);  

	/* TIM1 clock enable */	 
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE); 
 
#ifdef QUAD 
	/* USART2 clock enable */ 
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);  
  
	/* I2C clock enable */	 
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C1, ENABLE); 

	/* ADC1 clock enable */	 
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE); 

	/* DMA1 clock enable */	 
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);  

	// ADCCLK = PCLK2/4 = 56 MHz /4 = 14 MHz (maksymalna mozliwa)
    RCC_ADCCLKConfig(RCC_PCLK2_Div4);  

#endif 

#ifdef PILOT 
	/* TIM3 clock enable */	 
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE); 

	/* SPI2 clock enable */ 
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE); 

	/* SPI3 clock enable */ 
//    RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI3, ENABLE); 
#endif 

} 
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
void NVIC_Configuration(void)  
{ 
	NVIC_InitTypeDef NVIC_InitStructure; 
 
#ifdef  VECT_TAB_RAM 
  /* Set the Vector Table base location at 0x20000000 */ 
  NVIC_SetVectorTable(NVIC_VectTab_RAM, 0x0); 
#else  /* VECT_TAB_FLASH  */ 
  /* Set the Vector Table base location at 0x08000000 */ 
  NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0); 
#endif 
 
 
	/* NVIC for rfm12 */ 
 
	//Konfiguracja NVIC - ustawienia priorytetow przerwania EXT0 
	//Wybor modelu grupowania przerwan 
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_0); 

	//Wybor konfigurowanego IRQ 
	NVIC_InitStructure.NVIC_IRQChannel = EXTI9_5_IRQn; 	 	 
	//Priorytet grupowy 
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1; 
	//Podpriorytet 
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0; 
	//Wlaczenie obslugi IRQ 
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE; 
	NVIC_Init(&NVIC_InitStructure); 
 

	/* NVIC for TIM1 */ 

