Bartchez/quad-stm32/Program/_Application/main.c
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1); 

  	//przerwanie UP (przepelnienie) timera1
    NVIC_InitStructure.NVIC_IRQChannel = TIM1_UP_IRQn;
  	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  	NVIC_Init(&NVIC_InitStructure);

 
	/* NVIC for GPS */ 
 
#ifdef QUAD 
	// Wybranie grupy priorytetów  
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);  
 
	// Wlacz przerwanie od USART2  
	NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;  
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;  
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;  
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;  
	NVIC_Init(&NVIC_InitStructure);  
#endif 

} 
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
void EXTI_Configuration(void)  
{ 
	/* EXTI for rfm12 */ 
	EXTI_InitTypeDef EXTI_InitStructure; 

#ifdef QUAD 
	//Ustawienia zrodla przerwania 
	GPIO_EXTILineConfig(GPIO_PortSourceGPIOA, GPIO_PinSource9); 

	//Wybor lini 
	EXTI_InitStructure.EXTI_Line = EXTI_Line9; 
#else
	//Ustawienia zrodla przerwania 
	GPIO_EXTILineConfig(GPIO_PortSourceGPIOD, GPIO_PinSource8); 

	//Wybor lini 
	EXTI_InitStructure.EXTI_Line = EXTI_Line8; 
#endif
	 
	//Ustawienie generowania przerwania 
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt; 
	 
	//Wyzwalanie zboczem opadajacym 
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling; 
	 
	//Wlaczenie przerwania 
	EXTI_InitStructure.EXTI_LineCmd = ENABLE; 
	EXTI_Init(&EXTI_InitStructure);	 
} 
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
void SPI_Configuration(void) { 
 
	SPI_InitTypeDef SPI_InitStructure;  
 
	/* SPI for rfm12 */ 

	// Konfiguracja SPI 
	SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex; 
	SPI_InitStructure.SPI_Mode = SPI_Mode_Master; 
	SPI_InitStructure.SPI_DataSize = SPI_DataSize_16b; 
	SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low; 
	SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge; 
	SPI_InitStructure.SPI_NSS = SPI_NSS_Soft; 
	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_32; 
	SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB; 
	SPI_InitStructure.SPI_CRCPolynomial = 7; 
	SPI_Init(RFM12_SPI, &SPI_InitStructure); 
	SPI_Cmd(RFM12_SPI, ENABLE);  

#ifdef PILOT
	
	/* SPI for SD */ 

	// Konfiguracja SPI
	SPI_InitStructure.SPI_Direction =  SPI_Direction_2Lines_FullDuplex;
    SPI_InitStructure.SPI_Mode = SPI_Mode_Master;              
    SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;  
    SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
    SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
    SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
    SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_4;
    SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
    SPI_InitStructure.SPI_CRCPolynomial = 7;
    SPI_Init(SD_SPI, &SPI_InitStructure);   
    SPI_Cmd(SD_SPI, ENABLE);


	/* SPI for LCD */ 

	// Konfiguracja SPI
    SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
    SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
    SPI_InitStructure.SPI_DataSize = SPI_DataSize_16b;
    SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
    SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
    SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
    SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
    SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
    SPI_InitStructure.SPI_CRCPolynomial= 7;
    SPI_Init(LCD_SPI, &SPI_InitStructure);
    SPI_Cmd(LCD_SPI, ENABLE);

#endif
} 
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
void USART_Configuration(void) { 
 
#ifdef QUAD 
	USART_InitTypeDef USART_InitStructure;  
 
 	// dlugosc slowa = 8 bitow 
	USART_InitStructure.USART_WordLength = USART_WordLength_8b; 
	// 1 bit stopu 
	USART_InitStructure.USART_StopBits = USART_StopBits_1; 
	// Brak kontroli parzystosci 
	USART_InitStructure.USART_Parity = USART_Parity_No; 
	// Kontrola przeplywu danych wylaczona 
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None; 

	// reset 
	USART_DeInit(GPS_USART); 
 	// predkosc transmisji = 9600 
 	USART_InitStructure.USART_BaudRate = 9600; 
	//Tryb pracy (Rx - odbior, Tx - nadawanie) 
	USART_InitStructure.USART_Mode = USART_Mode_Rx; 
 
	// Init - USART 
	USART_Init(GPS_USART, &USART_InitStructure); 
	USART_ClearFlag(GPS_USART, USART_FLAG_TC); 
	// Wlaczenie przerwan wywolywanych przez USART2 
	USART_ITConfig(GPS_USART, USART_IT_RXNE, ENABLE); 
	// Wlaczenie USART 
	USART_Cmd(GPS_USART, ENABLE); 
#endif 
	/* USART for COM */ 

/* 

	// reset 
	USART_DeInit(COM_USART); 
 	// predkosc transmisji = 115200 
 	USART_InitStructure.USART_BaudRate = 115200; 
	//Tryb pracy (Rx - odbior, Tx - nadawanie) 
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx; 
 
	// Init - USART 
	USART_Init(COM_USART, &USART_InitStructure);  
	USART_ClearFlag(COM_USART,USART_FLAG_TC); 
	USART_ITConfig(COM_USART, USART_IT_RXNE, ENABLE); 
	USART_ITConfig(COM_USART, USART_IT_TXE, ENABLE); 
	// Wlaczenie USART 
	USART_Cmd(COM_USART, ENABLE); 
*/
} 
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
void TIM_Configuration(void)  
{ 
	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure; 

#ifdef PILOT 
	TIM_OCInitTypeDef  TIM_OCInitStructure; 
#endif
 
	/* TIM1 configuration */ 
 
	/* Time base configuration */ 
	TIM_TimeBaseStructure.TIM_Prescaler = 56000-1;          

#ifdef PILOT	
	TIM_TimeBaseStructure.TIM_Period = 10;		// 10ms
#else
	TIM_TimeBaseStructure.TIM_Period = 1000;	// 1sek.
#endif

	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1; 
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up; 
 
	TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStructure); 
	
	TIM_ITConfig(TIM1, TIM_IT_Update, ENABLE);	

	/* TIM1 enable counter */ 
	TIM_Cmd(TIM1, ENABLE);   

